Player_Data = [[0,0,[0,0,0,0,0],0,[0,0,0,0,0,0,1,1,0],3,4,15,0,0,0,0,[0,0,0,0,0,0]],[0,0,[0,0,0,0,0],0,[0,0,0,0,0,0,0,0,1],5,4,15,0,0,0,0,[0,0,0,0,0,0]],[0,0,[0,0,0,0,0],0,[0,0,0,0,0,0,0,0,0],5,4,15,0,0,0,0,[0,0,0,0,0,0]],[0,0,[0,0,0,0,0],0,[0,0,0,0,0,0,0,0,0],5,4,15,0,0,0,0,[0,0,0,0,0,0]]]
  #所持ポイント、所持資源カード合計枚数、所持資源カード枚数内訳(木、レンガ、羊、小麦、石)、所持発展カード合計枚数,その内訳(騎士、街道建設、発見、独占、大聖堂、図書館、市場、議会、大学),残り建設可能開拓地数、残り建設可能都市数、残り建設可能街道数、交易路の長さ、最長交易路の有無、騎士力,最大騎士力の有無、優位トレード所持(1(wood2-1),2(brick2-1),3(sheep2-1),4(wheat2-1),5(ore2-1),0(3-1))(所持しているときは1(デフォルト0))


def pointget(Player_Data,playernumber):
    point=0
    for i in range(4,9):
        point+=Player_Data[playernumber][4][i] #発展カードのうちの得点カードの枚数を足していく。
    point+=(5-Player_Data[playernumber][5])#現在建てている開拓地の数分１ポイント足す
    point+=(4-Player_Data[playernumber][6])*2 #現在建てている都市の数分追加で１ポイント足す
    if Player_Data[playernumber][9]!=0:#最長交易路の有無
        point+=2
    if Player_Data[playernumber][11]!=0:#最大騎士力の有無
        point+=2
    return point
    
print(pointget(Player_Data,1))
print(pointget(Player_Data,2))